blockMeshTesting/system/include/dimensions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

posR	#calc	"sqrt(0.5)";
negR	#calc	"-sqrt(0.5)";

posInner	0.1;
negInner	-0.1;

posAxial	10;
negAxial	-10;

// ************************************************************************* //
